7767517
304 362
Input                    in0                      0 1 in0
Convolution              conv_0                   1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
Swish                    silu_98                  1 1 1 2
Convolution              conv_1                   1 1 2 3 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608
Swish                    silu_99                  1 1 3 4
Convolution              conv_2                   1 1 4 5 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_100                 1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,16,16 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_3                   1 1 11 12 0=8 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152
Swish                    silu_101                 1 1 12 13
Convolution              conv_4                   1 1 13 14 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152
Swish                    silu_102                 1 1 14 15
BinaryOp                 add_0                    2 1 10 15 16 0=0
Concat                   cat_0                    3 1 7 9 16 17 0=0
Convolution              conv_5                   1 1 17 18 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072
Swish                    silu_103                 1 1 18 19
Split                    splitncnn_1              1 2 19 20 21
Convolution              conv_6                   1 1 21 22 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Swish                    silu_104                 1 1 22 23
Convolution              conv_7                   1 1 23 24 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_105                 1 1 24 25
Slice                    split_1                  1 2 25 26 27 -23300=2,32,32 1=0
Split                    splitncnn_2              1 3 27 28 29 30
Convolution              conv_8                   1 1 30 31 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_106                 1 1 31 32
Convolution              conv_9                   1 1 32 33 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_107                 1 1 33 34
BinaryOp                 add_1                    2 1 29 34 35 0=0
Concat                   cat_1                    3 1 26 28 35 36 0=0
Convolution              conv_10                  1 1 36 37 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Swish                    silu_108                 1 1 37 38
Split                    splitncnn_3              1 2 38 39 40
Convolution              conv_11                  1 1 40 41 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_109                 1 1 41 42
Convolution              conv_12                  1 1 42 43 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_110                 1 1 43 44
Slice                    split_2                  1 2 44 45 46 -23300=2,64,64 1=0
Split                    splitncnn_4              1 3 46 47 48 49
Convolution              conv_13                  1 1 49 50 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_111                 1 1 50 51
Split                    splitncnn_5              1 2 51 52 53
Convolution              conv_14                  1 1 53 54 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_112                 1 1 54 55
Convolution              conv_15                  1 1 55 56 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_113                 1 1 56 57
BinaryOp                 add_2                    2 1 52 57 58 0=0
Split                    splitncnn_6              1 2 58 59 60
Convolution              conv_16                  1 1 60 61 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_114                 1 1 61 62
Convolution              conv_17                  1 1 62 63 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_115                 1 1 63 64
BinaryOp                 add_3                    2 1 59 64 65 0=0
Convolution              conv_18                  1 1 48 66 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_116                 1 1 66 67
Concat                   cat_2                    2 1 65 67 68 0=0
Convolution              conv_19                  1 1 68 69 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_117                 1 1 69 70
Concat                   cat_3                    3 1 45 47 70 71 0=0
Convolution              conv_20                  1 1 71 72 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_118                 1 1 72 73
Split                    splitncnn_7              1 2 73 74 75
Convolution              conv_21                  1 1 75 76 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912
Swish                    silu_119                 1 1 76 77
Convolution              conv_22                  1 1 77 78 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_120                 1 1 78 79
Slice                    split_3                  1 2 79 80 81 -23300=2,128,128 1=0
Split                    splitncnn_8              1 3 81 82 83 84
Convolution              conv_23                  1 1 84 85 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_121                 1 1 85 86
Split                    splitncnn_9              1 2 86 87 88
Convolution              conv_24                  1 1 88 89 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_122                 1 1 89 90
Convolution              conv_25                  1 1 90 91 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_123                 1 1 91 92
BinaryOp                 add_4                    2 1 87 92 93 0=0
Split                    splitncnn_10             1 2 93 94 95
Convolution              conv_26                  1 1 95 96 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_124                 1 1 96 97
Convolution              conv_27                  1 1 97 98 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_125                 1 1 98 99
BinaryOp                 add_5                    2 1 94 99 100 0=0
Convolution              conv_28                  1 1 83 101 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_126                 1 1 101 102
Concat                   cat_4                    2 1 100 102 103 0=0
Convolution              conv_29                  1 1 103 104 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_127                 1 1 104 105
Concat                   cat_5                    3 1 80 82 105 106 0=0
Convolution              conv_30                  1 1 106 107 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_128                 1 1 107 108
Convolution              conv_31                  1 1 108 109 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_129                 1 1 109 110
Split                    splitncnn_11             1 2 110 111 112
Pooling                  maxpool2d_95             1 1 112 113 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_12             1 2 113 114 115
Pooling                  maxpool2d_96             1 1 115 116 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_13             1 2 116 117 118
Pooling                  maxpool2d_97             1 1 118 119 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_6                    4 1 111 114 117 119 120 0=0
Convolution              conv_32                  1 1 120 121 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_130                 1 1 121 122
Convolution              conv_33                  1 1 122 123 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_131                 1 1 123 124
Slice                    split_4                  1 2 124 125 126 -23300=2,128,128 1=0
Split                    splitncnn_14             1 2 126 127 128
Convolution              conv_34                  1 1 128 129 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Reshape                  view_207                 1 1 129 130 0=400 1=128 2=2
Slice                    split_5                  1 3 130 131 132 133 -23300=3,32,32,64 1=1
Split                    splitncnn_15             1 2 133 134 135
Permute                  transpose_211            1 1 131 136 0=1
MatMul                   matmul_209               2 1 136 132 137
BinaryOp                 mul_6                    1 1 137 138 0=2 1=1 2=1.767767e-01
Softmax                  softmax_197              1 1 138 139 0=2 1=1
MatMul                   matmultransb_0           2 1 135 139 140 0=1
Reshape                  view_208                 1 1 140 141 0=20 1=20 2=128
Reshape                  reshape_206              1 1 134 142 0=20 1=20 2=128
ConvolutionDepthWise     convdw_213               1 1 142 143 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
BinaryOp                 add_7                    2 1 141 143 144 0=0
Convolution              conv_35                  1 1 144 145 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_8                    2 1 127 145 146 0=0
Split                    splitncnn_16             1 2 146 147 148
Convolution              conv_36                  1 1 148 149 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_132                 1 1 149 150
Convolution              conv_37                  1 1 150 151 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_9                    2 1 147 151 152 0=0
Concat                   cat_7                    2 1 125 152 153 0=0
Convolution              conv_38                  1 1 153 154 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_133                 1 1 154 155
Split                    splitncnn_17             1 2 155 156 157
Interp                   upsample_190             1 1 157 158 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_8                    2 1 158 74 159 0=0
Convolution              conv_39                  1 1 159 160 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Swish                    silu_134                 1 1 160 161
Slice                    split_6                  1 2 161 162 163 -23300=2,64,64 1=0
Split                    splitncnn_18             1 3 163 164 165 166
Convolution              conv_40                  1 1 166 167 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_135                 1 1 167 168
Convolution              conv_41                  1 1 168 169 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_136                 1 1 169 170
BinaryOp                 add_10                   2 1 165 170 171 0=0
Concat                   cat_9                    3 1 162 164 171 172 0=0
Convolution              conv_42                  1 1 172 173 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_137                 1 1 173 174
Split                    splitncnn_19             1 2 174 175 176
Interp                   upsample_191             1 1 176 177 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_10                   2 1 177 39 178 0=0
Split                    splitncnn_20             1 2 178 179 180
Convolution              conv_43                  1 1 180 181 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_138                 1 1 181 182
Slice                    split_7                  1 2 182 183 184 -23300=2,32,32 1=0
Split                    splitncnn_21             1 3 184 185 186 187
Convolution              conv_44                  1 1 187 188 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_139                 1 1 188 189
Convolution              conv_45                  1 1 189 190 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_140                 1 1 190 191
BinaryOp                 add_11                   2 1 186 191 192 0=0
Concat                   cat_11                   3 1 183 185 192 193 0=0
Convolution              conv_46                  1 1 193 194 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_141                 1 1 194 195
Interp                   upsample_192             1 1 195 196 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_12                   2 1 196 20 197 0=0
Convolution              conv_47                  1 1 197 198 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_142                 1 1 198 199
Slice                    split_8                  1 2 199 200 201 -23300=2,16,16 1=0
Split                    splitncnn_22             1 3 201 202 203 204
Convolution              conv_48                  1 1 204 205 0=8 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152
Swish                    silu_143                 1 1 205 206
Convolution              conv_49                  1 1 206 207 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152
Swish                    silu_144                 1 1 207 208
BinaryOp                 add_12                   2 1 203 208 209 0=0
Concat                   cat_13                   3 1 200 202 209 210 0=0
Convolution              conv_50                  1 1 210 211 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Swish                    silu_145                 1 1 211 212
Split                    splitncnn_23             1 3 212 213 214 215
Convolution              conv_51                  1 1 214 216 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=9216
Swish                    silu_146                 1 1 216 217
Concat                   cat_14                   2 1 217 179 218 0=0
Convolution              conv_52                  1 1 218 219 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
Swish                    silu_147                 1 1 219 220
Slice                    split_9                  1 2 220 221 222 -23300=2,32,32 1=0
Split                    splitncnn_24             1 3 222 223 224 225
Convolution              conv_53                  1 1 225 226 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_148                 1 1 226 227
Convolution              conv_54                  1 1 227 228 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_149                 1 1 228 229
BinaryOp                 add_13                   2 1 224 229 230 0=0
Concat                   cat_15                   3 1 221 223 230 231 0=0
Convolution              conv_55                  1 1 231 232 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_150                 1 1 232 233
Split                    splitncnn_25             1 3 233 234 235 236
Convolution              conv_56                  1 1 235 237 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Swish                    silu_151                 1 1 237 238
Concat                   cat_16                   2 1 238 175 239 0=0
Convolution              conv_57                  1 1 239 240 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_152                 1 1 240 241
Slice                    split_10                 1 2 241 242 243 -23300=2,64,64 1=0
Split                    splitncnn_26             1 3 243 244 245 246
Convolution              conv_58                  1 1 246 247 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_153                 1 1 247 248
Convolution              conv_59                  1 1 248 249 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_154                 1 1 249 250
BinaryOp                 add_14                   2 1 245 250 251 0=0
Concat                   cat_17                   3 1 242 244 251 252 0=0
Convolution              conv_60                  1 1 252 253 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_155                 1 1 253 254
Split                    splitncnn_27             1 3 254 255 256 257
Convolution              conv_61                  1 1 256 258 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_156                 1 1 258 259
Concat                   cat_18                   2 1 259 156 260 0=0
Convolution              conv_62                  1 1 260 261 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_157                 1 1 261 262
Slice                    split_11                 1 2 262 263 264 -23300=2,128,128 1=0
Split                    splitncnn_28             1 3 264 265 266 267
Convolution              conv_63                  1 1 267 268 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_158                 1 1 268 269
Split                    splitncnn_29             1 2 269 270 271
Convolution              conv_64                  1 1 271 272 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_159                 1 1 272 273
Convolution              conv_65                  1 1 273 274 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_160                 1 1 274 275
BinaryOp                 add_15                   2 1 270 275 276 0=0
Split                    splitncnn_30             1 2 276 277 278
Convolution              conv_66                  1 1 278 279 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_161                 1 1 279 280
Convolution              conv_67                  1 1 280 281 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_162                 1 1 281 282
BinaryOp                 add_16                   2 1 277 282 283 0=0
Convolution              conv_68                  1 1 266 284 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_163                 1 1 284 285
Concat                   cat_19                   2 1 283 285 286 0=0
Convolution              conv_69                  1 1 286 287 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_164                 1 1 287 288
Concat                   cat_20                   3 1 263 265 288 289 0=0
Convolution              conv_70                  1 1 289 290 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_165                 1 1 290 291
Split                    splitncnn_31             1 2 291 292 293
Convolution              conv_71                  1 1 213 294 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_166                 1 1 294 295
Convolution              conv_72                  1 1 295 296 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_167                 1 1 296 297
Convolution              conv_73                  1 1 297 298 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Permute                  permute_198              1 1 298 299 0=3
ConvolutionDepthWise     convdw_214               1 1 215 300 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32
Swish                    silu_168                 1 1 300 301
Convolution              conv_74                  1 1 301 302 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_169                 1 1 302 303
ConvolutionDepthWise     convdw_215               1 1 303 304 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32
Swish                    silu_170                 1 1 304 305
Convolution              conv_75                  1 1 305 306 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_171                 1 1 306 307
Convolution              convsigmoid_0            1 1 307 308 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32 9=4
Permute                  permute_199              1 1 308 309 0=3
Concat                   cat_21                   2 1 299 309 out0 0=2
Convolution              conv_77                  1 1 234 311 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_172                 1 1 311 312
Convolution              conv_78                  1 1 312 313 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_173                 1 1 313 314
Convolution              conv_79                  1 1 314 315 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Permute                  permute_200              1 1 315 316 0=3
ConvolutionDepthWise     convdw_216               1 1 236 317 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Swish                    silu_174                 1 1 317 318
Convolution              conv_80                  1 1 318 319 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_175                 1 1 319 320
ConvolutionDepthWise     convdw_217               1 1 320 321 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32
Swish                    silu_176                 1 1 321 322
Convolution              conv_81                  1 1 322 323 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_177                 1 1 323 324
Convolution              convsigmoid_1            1 1 324 325 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32 9=4
Permute                  permute_201              1 1 325 326 0=3
Concat                   cat_22                   2 1 316 326 out1 0=2
Convolution              conv_83                  1 1 255 328 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_178                 1 1 328 329
Convolution              conv_84                  1 1 329 330 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_179                 1 1 330 331
Convolution              conv_85                  1 1 331 332 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Permute                  permute_202              1 1 332 333 0=3
ConvolutionDepthWise     convdw_218               1 1 257 334 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Swish                    silu_180                 1 1 334 335
Convolution              conv_86                  1 1 335 336 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_181                 1 1 336 337
ConvolutionDepthWise     convdw_219               1 1 337 338 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32
Swish                    silu_182                 1 1 338 339
Convolution              conv_87                  1 1 339 340 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_183                 1 1 340 341
Convolution              convsigmoid_2            1 1 341 342 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32 9=4
Permute                  permute_203              1 1 342 343 0=3
Concat                   cat_23                   2 1 333 343 out2 0=2
Convolution              conv_89                  1 1 292 345 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_184                 1 1 345 346
Convolution              conv_90                  1 1 346 347 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_185                 1 1 347 348
Convolution              conv_91                  1 1 348 349 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Permute                  permute_204              1 1 349 350 0=3
ConvolutionDepthWise     convdw_220               1 1 293 351 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Swish                    silu_186                 1 1 351 352
Convolution              conv_92                  1 1 352 353 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_187                 1 1 353 354
ConvolutionDepthWise     convdw_221               1 1 354 355 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32
Swish                    silu_188                 1 1 355 356
Convolution              conv_93                  1 1 356 357 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_189                 1 1 357 358
Convolution              convsigmoid_3            1 1 358 359 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32 9=4
Permute                  permute_205              1 1 359 360 0=3
Concat                   cat_24                   2 1 350 360 out3 0=2
